RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
/**
  ******************************************************************************
  * @file    stm32l4xx_rcc.c
  * @author  MCD Application Team
  * @version VX.Y.Z (Start from version V1.0.0)
  * @date    DD-Month-YYYY
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the Reset and clock control (RCC) peripheral:
  *           + Internal/external clocks, PLL, CSS and MCO configuration
  *           + System, AHB and APB busses clocks configuration
  *           + Peripheral clocks configuration
  *           + Interrupts and flags management
  *
 @verbatim                
 ===============================================================================
                      ##### RCC specific features #####
 ===============================================================================
    [..]  
      After reset the device is running from Multiple Speed Internal oscillator.
      (4 MHz) with Flash 0 wait state, Flash prefetch buffer, D-Cache 
      and I-Cache are disabled, and all peripherals are off except internal
      SRAM, Flash and JTAG.(TBC)
      (+) There is no prescaler on High speed (AHB) and Low speed (APB) busses;
          all peripherals mapped on these busses are running at HSI speed.
      (+) The clock for all peripherals is switched off, except the SRAM and FLASH.
      (+) All GPIOs are in input floating state, except the JTAG pins which
          are assigned to be used for debug purpose.
    [..]          
      Once the device started from reset, the user application has to:        
      (+) Configure the clock source to be used to drive the System clock
          (if the application needs higher frequency/performance)
      (+) Configure the System clock frequency and Flash settings  
      (+) Configure the AHB and APB busses prescalers
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the clock source(s) for peripherals which clocks are not
          derived from the System clock (SAI, RTC, ADC, USB OTG FS/SDIO/RNG)                                
 @endverbatim    
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_rcc.h"
#include "stm32l4xx_conf.h" 
/** @addtogroup STM32L4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup RCC 
  * @brief RCC driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* ------------ RCC registers bit address in the alias region ----------- */
#define RCC_OFFSET                (RCC_BASE - PERIPH_BASE)
/* --- CR Register ---*/
/* Alias word address of HSION bit */
#define CR_OFFSET                 (RCC_OFFSET + 0x00)
#define HSION_BitNumber           0x08
#define CR_HSION_BB               (PERIPH_BB_BASE + (CR_OFFSET * 32) + (HSION_BitNumber * 4))
   /* Alias word address of MSION bit */
#define MSION_BitNumber           0x00
#define CR_MSION_BB               (PERIPH_BB_BASE + (CR_OFFSET * 32) + (MSION_BitNumber * 4))
    
/* Alias word address of HSECSSON bit */
#define HSECSSON_BitNumber        0x13
#define CR_HSECSSON_BB            (PERIPH_BB_BASE + (CR_OFFSET * 32) + (HSECSSON_BitNumber * 4))

/* Alias word address of PLLON bit */
#define PLLON_BitNumber           0x18
#define CR_PLLON_BB               (PERIPH_BB_BASE + (CR_OFFSET * 32) + (PLLON_BitNumber * 4))

/* Alias word address of PLLSAI1ON bit */
#define PLLSAI1ON_BitNumber         0x1A
#define CR_PLLSAI1ON_BB            (PERIPH_BB_BASE + (CR_OFFSET * 32) + (PLLSAI1ON_BitNumber * 4))

/* Alias word address of PLLSAI2ON bit */
#define PLLSAI2ON_BitNumber        0x1C
#define CR_PLLSAI2ON_BB            (PERIPH_BB_BASE + (CR_OFFSET * 32) + (PLLSAI2ON_BitNumber * 4))

 /* --- CFGR Register ---*/
#define CFGR_OFFSET                (RCC_OFFSET + 0x08)
#define STOPWUCK_BitNumber         0xF
#define CFGR_STOPWUCK_BB          (PERIPH_BB_BASE + (CFGR_OFFSET * 32) + (STOPWUCK_BitNumber * 4))   
    
 /* --- PLLCFGR Register ---*/ 
#define PLLCFGR_OFFSET             (RCC_OFFSET + 0x0C)
#define PLLSYSPEN_BitNumber        0x10
#define PLLCFGR_PLLSYSPEN_BB       (PERIPH_BB_BASE + (PLLCFGR_OFFSET * 32) + (PLLSYSPEN_BitNumber * 4))

  /* --- PLLSAI1CFGR Register ---*/ 
#define PLLSAI1CFGR_OFFSET          (RCC_OFFSET + 0x10)
#define PLLSAI1PEN_BitNumber        0x10
#define PLLSAI1CFGR_PLLSAI1PEN_BB   (PERIPH_BB_BASE + (PLLSAI1CFGR_OFFSET * 32) + (PLLSAI1PEN_BitNumber * 4))

  /* --- PLLSAI2CFGR Register ---*/ 
#define PLLSAI2CFGR_OFFSET          (RCC_OFFSET + 0x14)
#define PLLSAI2PEN_BitNumber         0x10
#define PLLSAI2CFGR_PLLSAI2PEN_BB   (PERIPH_BB_BASE + (PLLSAI2CFGR_OFFSET * 32) + (PLLSYSPEN_BitNumber * 4))

/* --- CCIPR Register ---*/
#define CCIPR_OFFSET                 (RCC_OFFSET + 0x88)
#define DFSDMSRC_BitNumber           0x1F
#define CCIPR_DFSDMSRC_BB            (PERIPH_BB_BASE + (CCIPR_OFFSET * 32) + (DFSDMSRC_BitNumber * 4))
#define SWPSRC_BitNumber             0x1E
#define CCIPR_SWPSRC_BB             (PERIPH_BB_BASE + (CCIPR_OFFSET * 32) + (SWPSRC_BitNumber * 4))
    
/* --- BDCR Register ---*/
/* Alias word address of RTCEN bit */
#define BDCR_OFFSET               (RCC_OFFSET + 0x90)
#define RTCEN_BitNumber           0x0F
#define BDCR_RTCEN_BB             (PERIPH_BB_BASE + (BDCR_OFFSET * 32) + (RTCEN_BitNumber * 4))
/* Alias word address of LSECSSON bit */
#define LSECSSON_BitNumber        0x05
#define BDCR_LSECSSON_BB          (PERIPH_BB_BASE + (BDCR_OFFSET * 32) + (LSECSSON_BitNumber * 4))
    
/* Alias word address of BDRST bit */
#define BDRST_BitNumber           0x10
#define BDCR_BDRST_BB             (PERIPH_BB_BASE + (BDCR_OFFSET * 32) + (BDRST_BitNumber * 4))

/* --- CSR Register ---*/
/* Alias word address of LSION bit */
#define CSR_OFFSET                (RCC_OFFSET + 0x94)
#define LSION_BitNumber           0x00
#define CSR_LSION_BB              (PERIPH_BB_BASE + (CSR_OFFSET * 32) + (LSION_BitNumber * 4))

/* ---------------------- RCC registers bit mask ------------------------ */
/* CFGR register bit mask */
#define CFGR_MCO_RESET_MASK      ((uint32_t)0x88FFFFFF)

