RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
/* RCC Flag Mask */
#define RCC_FLAG_MASK                 ((uint8_t)0x1F)
 
/* CR register byte 3 (Bits[23:16]) base address */
#define CR_BYTE3_ADDRESS         ((uint32_t)(RCC_BASE + 0x00 + 0x02))

 /* CR register byte 2 (Bits[15:8]) base address */
#define ICSCR_BYTE2_ADDRESS         ((uint32_t)(RCC_BASE + 0x04 + 0x01))   
    
/* BDCR register base address */
#define BDCR_ADDRESS              (PERIPH_BASE + BDCR_OFFSET)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
// static __I uint8_t APBAHBPrescTable[16] = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
// const uint32_t MSIRangeTable[12] =
// {100000, 200000, 400000, 800000, 1000000, 2000000, 4000000,
//  8000000, 16000000, 24000000, 32000000, 48000000};

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup RCC_Private_Functions
  * @{
  */ 

/** @defgroup RCC_Group1 Internal and external clocks, PLL, CSS and MCO configuration functions
 *  @brief   Internal and external clocks, PLL, CSS and MCO configuration functions 
 *
@verbatim   
 ===================================================================================
 ##### Internal and  external clocks, PLL, CSS and MCO configuration functions #####
 ===================================================================================  
    [..]
      This section provide functions allowing to configure the internal/external clocks,
      PLLs, CSS and MCO pins.
  
      (#) HSI (high-speed internal), 16 MHz factory-trimmed RC used directly or through
          the PLL as System clock source.

      (#) LSI (low-speed internal), 32 KHz low consumption RC used as IWDG and/or RTC
          clock source.

      (#) HSE (high-speed external), 4 to 48 MHz crystal oscillator used directly or
          through the PLL as System clock source. Can be used also as RTC clock source.

      (#) LSE (low-speed external), 32 KHz oscillator used as RTC clock source.   
      
      (#) MSI (Mutiple Speed Internal), Its frequency is software trimmable from 100KHZ to 48MHZ.   
         It can be used to generate the clock for the USB OTG FS (48 MHz).

      (#) PLL (clocked by HSI , HSE or MSI), featuring three different output clocks:
        (++) The first output is used to generate the high speed system clock (up to 80MHz)
        (++) The second output is used to generate the clock for the USB OTG FS (48 MHz),
             the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
        (++) The Third output is used to generate an accurate clock to achieve 
             high-quality audio performance on SAI interface in case.

      (#) PLLSAI1 (clocked by HSI , HSE or MSI), featuring three different output clocks: 
        (++) The first output is used to generate SAR ADC1 clock.
        (++) The second output is used to generate the clock for the USB OTG FS (48 MHz),
             the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
        (++) The Third output is used to generate an accurate clock to achieve 
             high-quality audio performance on SAI interface in case.

     (#) PLLSAI2 (clocked by HSI , HSE or MSI), featuring three different output clocks: 
        (++) The first output is used to generate SAR ADC2 clock.
        (++) The second output is used to generate the clock for the USB OTG FS (48 MHz),
             the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
        (++) The Third output is used to generate an accurate clock to achieve 
             high-quality audio performance on SAI interface in case.


      (#) CSS (Clock security system), once enable and if a HSE clock failure occurs 
         (HSE used directly or through PLL as System clock source), the System clock
         is automatically switched to HSI and an interrupt is generated if enabled. 
         The interrupt is linked to the Cortex-M4 NMI (Non-Maskable Interrupt) 
         exception vector.   

      (#) MCO (microcontroller clock output), used to output MSI, HSI, LSE, HSE or PLL
          clock (through a configurable prescaler) on PA8 pin. (TBC)

 @endverbatim
  * @{
  */

/**
  * @brief  Resets the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - MSI  ON and used as system clock source
  *            - HSE, HSI, PLL and PLLSAIx OFF
  *            - AHB, APB1 and APB2 prescaler set to 1.
  *            - CSS, MCO OFF
  *            - All interrupts disabled
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks  
  *            - LSI, LSE and RTC clocks 
  * @param  None
  * @retval None
  */
void RCC_DeInit(void)
{
  /* Set MSION bit */
  RCC->CR |= (uint32_t)0x00000001;

  /* Reset CFGR register */
  RCC->CFGR = 0x00000000;

  /* Reset HSION, HSIKERON, HSIASFS, HSEON, HSECSSON, PLLSYSON, PLLSAIxON bits */
  RCC->CR &= (uint32_t)0xEAF6F4F7;

  /* Reset PLLCFGR register */
  RCC->PLLCFGR = 0x00000800;
 
  /* Reset PLLSAIxCFGR register */
  RCC->PLLSAI1CFGR =  0x00000800;
  RCC->PLLSAI2CFGR =  0x00000800;
  
  /* Reset HSEBYP bit */
  RCC->CR &= (uint32_t)0xFFFBFFFF;

  /* Disable all interrupts */
  RCC->CIER = 0x00000000;
}

/**
  * @brief  Configures the External High Speed oscillator (HSE).
  * @note   After enabling the HSE (RCC_HSE_ON or RCC_HSE_Bypass), the application
  *         software should wait on HSERDY flag to be set indicating that HSE clock
  *         is stable and can be used to clock the PLL and/or system clock.
  * @note   HSE state can not be changed if it is used directly or through the
  *         PLL as system clock. In this case, you have to select another source
  *         of the system clock then change the HSE state (ex. disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY modes.  
  * @note   This function reset the CSSON bit, so if the Clock security system(CSS)
  *         was previously enabled you have to enable it again after calling this
  *         function.    
  * @param  RCC_HSE: specifies the new state of the HSE.
  *          This parameter can be one of the following values:
  *            @arg RCC_HSE_OFF: turn OFF the HSE oscillator, HSERDY flag goes low after
  *                              6 HSE oscillator clock cycles.
  *            @arg RCC_HSE_ON: turn ON the HSE oscillator
  *            @arg RCC_HSE_Bypass: HSE oscillator bypassed with external clock
  * @retval None
  */
void RCC_HSEConfig(uint8_t RCC_HSE)
{
  /* Check the parameters */
  assert_param(IS_RCC_HSE(RCC_HSE));

  /* Reset HSEON and HSEBYP bits before configuring the HSE ------------------*/
  *(__IO uint8_t *) CR_BYTE3_ADDRESS = RCC_HSE_OFF;

  /* Set the new HSE configuration -------------------------------------------*/
  *(__IO uint8_t *) CR_BYTE3_ADDRESS = RCC_HSE;
}


/**
  * @brief  Waits for HSE start-up.
  * @note   This functions waits on HSERDY flag to be set and return SUCCESS if 
  *         this flag is set, otherwise returns ERROR if the timeout is reached 
  *         and this flag is not set. The timeout value is defined by the constant
  *         HSE_STARTUP_TIMEOUT in stm32l4xx.h file. You can tailor it depending
  *         on the HSE crystal used in your application. 
  * @param  None
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: HSE oscillator is stable and ready to use
  *          - ERROR: HSE oscillator not yet ready
  */
ErrorStatus RCC_WaitForHSEStartUp(void)
{
  __IO uint32_t startupcounter = 0;
  ErrorStatus status = ERROR;
  FlagStatus hsestatus = RESET;
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    hsestatus = RCC_GetFlagStatus(RCC_FLAG_HSERDY);
    startupcounter++;
  } while((startupcounter != HSE_STARTUP_TIMEOUT) && (hsestatus == RESET));

  if (RCC_GetFlagStatus(RCC_FLAG_HSERDY) != RESET)
  {
    status = SUCCESS;
  }
  else
  {
    status = ERROR;
  }
  return (status);
}
/**
  * @brief  Adjusts the Internal Multi Speed oscillator (MSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal MSI RC.
  *         Refer to the Application Note AN3300 for more details on how to  
  *         calibrate the MSI.
  * @param  MSICalibrationValue: specifies the MSI calibration trimming value.
  *   This parameter must be a number between 0 and 0xFF.
  * @retval None
  */
void RCC_AdjustMSICalibrationValue(uint32_t MSICalibrationValue)
{
  
  /* Check the parameters */
  assert_param(IS_RCC_MSI_CALIBRATION_VALUE(MSICalibrationValue));

  *(__IO uint8_t *) ICSCR_BYTE2_ADDRESS = MSICalibrationValue;  
}

/**
  * @brief  Configures the Internal Multi Speed oscillator (MSI) clock range in run mode
  * @note     After restart from Reset , the MSI clock is around 4 MHz. 
  *           After stop the startup clock can be MSI (at any of its possible 
  *           frequencies, the one that was used before enteringstop mode) or HSI.
  *          After Standby its frequency can be selected between 4 possible values 
  *          (1, 2, 4 or 8 MHz), refer to RCC_MSIStandbyRangeConfig().
  * @note     MSIRANGE can be modified when MSI is OFF (MSION=0) or when MSI is ready
  *          (MSIRDY=1).
  *  @note    The MSI clock range after reset can be modified on the fly.     
  * @param  RCC_MSIRange: specifies the MSI Clock range.
  *   This parameter must be one of the following values:
  *     @arg RCC_MSIRange_0: MSI clock is around 100 KHz
  *     @arg RCC_MSIRange_1: MSI clock is around 200 KHz
  *     @arg RCC_MSIRange_2: MSI clock is around 400 KHz
  *     @arg RCC_MSIRange_3: MSI clock is around 800 KHz
  *     @arg RCC_MSIRange_4: MSI clock is around 1 MHz
  *     @arg RCC_MSIRange_5: MSI clock is around 2MHz 
  *     @arg RCC_MSIRange_6: MSI clock is around 4MHz (default after Reset)
  *     @arg RCC_MSIRange_7: MSI clock is around 8  MHz
  *     @arg RCC_MSIRange_8: MSI clock is around 16 MHz 
  *     @arg RCC_MSIRange_9: MSI clock is around 24 MHz
  *     @arg RCC_MSIRange_10: MSI clock is around 32 MHz 
  *     @arg RCC_MSIRange_11: MSI clock is around 48 MHz 
  *                   
  * @retval None
  */
void RCC_MSIRangeConfig(uint32_t RCC_MSIRange)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_RCC_MSI_CLOCK_RANGE(RCC_MSIRange));
  
  /*select that MSI range is read in V12 part*/
  RCC->CR |=RCC_CR_MSIRGSEL ;
    
