RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
  /* Configure LSE (RCC_LSE_OFF is already covered by the code section above) */
  switch (RCC_LSE)
  {
    case RCC_LSE_ON:
      /* Set LSEON bit */
      *(__IO uint8_t *) BDCR_ADDRESS = RCC_LSE_ON;
      break;
    case RCC_LSE_Bypass:
      /* Set LSEBYP and LSEON bits */
      *(__IO uint8_t *) BDCR_ADDRESS = RCC_LSE_Bypass | RCC_LSE_ON;
      break;
    default:
      break;
  }
}

/**
  * @brief  Enables or disables the Internal Low Speed oscillator (LSI).
  * @note   After enabling the LSI, the application software should wait on 
  *         LSIRDY flag to be set indicating that LSI clock is stable and can
  *         be used to clock the IWDG and/or the RTC.
  * @note   LSI can not be disabled if the IWDG is running.  
  * @param  NewState: new state of the LSI.
  *          This parameter can be: ENABLE or DISABLE.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 6 LSI oscillator
  *         clock cycles. 
  * @retval None
  */
void RCC_LSICmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) CSR_LSION_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the main PLL clock source, multiplication and division factors.
  * @note   This function must be used only when the main PLL is disabled.
  *  
  * @param  RCC_PLLSource: specifies the PLL entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_PLLSource_MSI: MSI oscillator clock selected as PLL clock entry
  *            @arg RCC_PLLSource_HSI: HSI oscillator clock selected as PLL clock entry
  *            @arg RCC_PLLSource_HSE: HSE oscillator clock selected as PLL clock entry
  * @note   This clock source (RCC_PLLSource) is common for the main PLL and PLLSAI1 & PLLSAI2 .  
  *  
  * @param  PLLM: specifies the division factor for PLL VCO input clock
  *          This parameter must be a number between 1 and 8.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 4 to 8 MHz. It is recommended to select a frequency
  *         of 8 MHz to limit PLL jitter. (TBC)
  *  
  * @param  PLLN: specifies the multiplication factor for PLL VCO output clock
  *          This parameter must be a number between 8 and 86.
  * @note   You have to set the PLLN parameter correctly to ensure that the VCO
  *         output frequency is between 64 and 344 MHz.
  *   
  * @param  PLLP: specifies the division factor for SAI clock.
  *          This parameter must be a number in the range {7 or 17}.
  *  
  * @param  PLLQ: specifies the division factor for OTG FS, SDIO and RNG clocks
  *          This parameter must be in the range (2 , 4 ,6 or 8)
  * @note   If the USB OTG FS is used in your application, you have to set the
  *         PLLQ parameter correctly to have 48 MHz clock for the USB. However,
  *         the SDIO and RNG need a frequency lower than or equal to 48 MHz to work
  *         correctly.
  * @param  PLLR: specifies the division factor for the main system clock.
  * @note   You have to set the PLLR parameter correctly to not execced 80MHZ.
  *          This parameter must be in the range (2 , 4 ,6 or 8)
  * @retval None
  */
void RCC_PLLConfig(uint32_t RCC_PLLSource, uint32_t PLLM, uint32_t PLLN, uint32_t PLLP, uint32_t PLLQ ,uint32_t PLLR)
{
  /* Check the parameters */
  assert_param(IS_RCC_PLL_SOURCE(RCC_PLLSource));
  assert_param(IS_RCC_PLLM_VALUE(PLLM));
  assert_param(IS_RCC_PLLN_VALUE(PLLN));
  assert_param(IS_RCC_PLLP_VALUE(PLLP));
  assert_param(IS_RCC_PLLQ_VALUE(PLLQ));
  assert_param(IS_RCC_PLLR_VALUE(PLLR));

  RCC->PLLCFGR = ((PLLM-1) << 4) | (PLLN << 8) | ((PLLP >> 4 ) << 17) | (RCC_PLLSource) |
                 (((PLLQ /2)-1) << 21) | (((PLLR/2)-1) << 25) ;
}

/**
  * @brief  Enables or disables the main PLL.
  * @note   After enabling the main PLL, the application software should wait on 
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  * @note   The main PLL can not be disabled if it is used as system clock source
  * @note   The main PLL is disabled by hardware when entering STOP and STANDBY modes.
  * @param  NewState: new state of the main PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLLCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_PLLON_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables each clock output (ck_pll_P, ck_pll_Q, ck_pll_R PLL.)
  * @note   Enabling/disabling  Those Clocks can be anytime  without the need to stop the PLL, 
  *        (except the ck_pll_R of the System PLL that cannot be stopped if used as System
  *         Clock.This is mainly used to save Power.
  * @param  RCC_PLLClockOut: specifies the PLL clock to be output 
  *          This parameter can be one of the following values:
  *            @arg RCC_PLLCLk_P: This clock is used to generate an accurate clock to achieve 
  *                               high-quality audio performance on SAI interface in case.
  *            @arg RCC_PLLCLk_Q: This Clock is used to generate the clock for the USB OTG FS (48 MHz),
  *                               the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
  *            @arg RCC_PLLCLk_R: This Clock is used to generate the high speed system clock (up to 80MHz)
  * @param  NewState: new state of the main PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


void RCC_PLLClockOutCmd(uint32_t RCC_PLLClockOut, FunctionalState NewState)
{
    __IO uint32_t tmp = 0;
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_RCC_PLLCLOCKOUT_VALUE(RCC_PLLClockOut));

  tmp = PLLCFGR_PLLSYSPEN_BB + RCC_PLLClockOut;
  
  *(__IO uint32_t *) (tmp) = (uint32_t)NewState;   
    
}



/**
  * @brief  Configures the PLLSAI1 clock multiplication and division factors.
  *
  * @note   This function must be used only when the PLLSAI1 is disabled.
  * @note   PLLSAI1 clock source is common with the main PLL (configured in 
  *         RCC_PLLConfig function )  
  *             
  * @param  PLLSAI1N: specifies the multiplication factor for PLLSAI1 VCO output clock
  *          This parameter must be a number between 8 and 86.
  * @note   You have to set the PLLSAI1N parameter correctly to ensure that the VCO 
  *         output frequency is between 64 and 344 MHz.
  *
  * @param  PLLSAI1P: specifies the division factor for SAI clock
  *          This parameter must be a number in the range {7 or 17}.
  *           
  * @param  PLLSAI1Q: specifies the division factor for USB clock
  *          This parameter must be in the range (2 , 4 ,6 or 8)
  *            
  * @param  PLLSAI1R: specifies the division factor for SAR ADC clock
  *          This parameter must be in the range (2 , 4 ,6 or 8)
  *   
  * @retval None
  */
void RCC_PLLSAI1Config(uint32_t PLLSAI1N, uint32_t PLLSAI1P,uint32_t PLLSAI1Q, uint32_t PLLSAI1R)
{
  /* Check the parameters */
  assert_param(IS_RCC_PLLSAI1N_VALUE(PLLSAI1N));
  assert_param(IS_RCC_PLLSAI1P_VALUE(PLLSAI1P));
  assert_param(IS_RCC_PLLSAI1Q_VALUE(PLLSAI1Q));
  assert_param(IS_RCC_PLLSAI1R_VALUE(PLLSAI1R));
  
  RCC->PLLSAI1CFGR = (PLLSAI1N << 8) | ((PLLSAI1P >> 4 ) << 17)  | (((PLLSAI1Q /2)-1) << 21) | (((PLLSAI1R/2)-1) << 25) ;
   
   
