RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
}

/**
  * @brief  Enables or disables the PLLSAI1. 
  * 
  * @note   The PLLSAI1 is disabled by hardware when entering STOP and STANDBY modes.  
  * @param  NewState: new state of the PLLSAI1. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLLSAI1Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_PLLSAI1ON_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the PLLSAI2 clock multiplication and division factors.
  *
  * @note   This function must be used only when the PLLSAI2 is disabled.
  * @note   PLLSAI2 clock source is common with the main PLL (configured in 
  *         RCC_PLLConfig function )  
  *             
  * @param  PLLSAI2N: specifies the multiplication factor for PLLSAI2 VCO output clock
  *          This parameter must be a number between 8 and 86.
  * @note   You have to set the PLLSAI2N parameter correctly to ensure that the VCO 
  *         output frequency is between 64 and 344 MHz.
  *
  * @param  PLLSAI1P: specifies the division factor for SAI clock
  *           This parameter must be a number in the range {7 or 17}.
  *           
  * @param  PLLSAI2Q: specifies the division factor for USB clock
  *           This parameter must be in the range (2 , 4 ,6 or 8)
  *            
  * @param  PLLSAI2R: specifies the division factor for SAR ADC clock
  *          This parameter must be in the range (2 , 4 ,6 or 8)
  *   
  * @retval None
  */

/**
  * @brief  Enables or disables each clock output (ck_pll_P, ck_pll_Q, ck_pll_R PLL.)
  * @note   Enabling/disabling  Those Clocks can be anytime  without the need to stop the PLL, 
  *         This is mainly used to save Power.
  * @param  RCC_PLLSAI1ClockOut: specifies the PLL clock to be output 
  *          This parameter can be one of the following values:
  *            @arg RCC_PLLSAI1CLk_P: This clock is used to generate an accurate clock to achieve 
  *                               high-quality audio performance on SAI interface in case.
  *            @arg RCC_PLLSAI1CLk_Q: This Clock is used to generate the clock for the USB OTG FS (48 MHz),
  *                               the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
  *            @arg RCC_PLLSAI1CLk_R: This Clock is used to generate the high speed system clock (up to 80MHz)
  * @param  NewState: new state of the main PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


void RCC_PLLSAI1ClockOutCmd(uint32_t RCC_PLLSAI1ClockOut, FunctionalState NewState)
{
    __IO uint32_t tmp = 0;
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_RCC_PLLSAI1CLOCKOUT_VALUE(RCC_PLLSAI1ClockOut));

  tmp = PLLSAI1CFGR_PLLSAI1PEN_BB + RCC_PLLSAI1ClockOut;
  
  *(__IO uint32_t *) (tmp) = (uint32_t)NewState;   
    
}

void RCC_PLLSAI2Config(uint32_t PLLSAI2N, uint32_t PLLSAI2P, uint32_t PLLSAI2Q, uint32_t PLLSAI2R)
{
  /* Check the parameters */
  assert_param(IS_RCC_PLLSAI2N_VALUE(PLLSAI2N));
  assert_param(IS_RCC_PLLSAI2P_VALUE(PLLSAI2P));
  assert_param(IS_RCC_PLLSAI2Q_VALUE(PLLSAI2Q));
  assert_param(IS_RCC_PLLSAI2R_VALUE(PLLSAI2R));
 
   RCC->PLLSAI2CFGR = (PLLSAI2N << 8) | ((PLLSAI2P >> 4 ) << 17)  | (((PLLSAI2Q /2)-1) << 21) | (((PLLSAI2R/2)-1) << 25) ;
}

/**
  * @brief  Enables or disables the PLLSAI2. 
  * 
  * @note   The PLLSAI2 is disabled by hardware when entering STOP and STANDBY modes.  
  * @param  NewState: new state of the PLLSAI2. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLLSAI2Cmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_PLLSAI2ON_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables each clock output (ck_pll_P, ck_pll_Q, ck_pll_R PLL.)
  * @note   Enabling/disabling  Those Clocks can be anytime  without the need to stop the PLL, 
  *         This is mainly used to save Power.
  * @param  RCC_PLLSAI2ClockOut: specifies the PLL clock to be output 
  *          This parameter can be one of the following values:
  *            @arg RCC_PLLSAI2CLk_P: This clock is used to generate an accurate clock to achieve 
  *                               high-quality audio performance on SAI interface in case.
  *            @arg RCC_PLLSAI2CLk_Q: This Clock is used to generate the clock for the USB OTG FS (48 MHz),
  *                               the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).
  *            @arg RCC_PLLSAI2CLk_R: This Clock is used to generate the high speed system clock (up to 80MHz)
  * @param  NewState: new state of the main PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


void RCC_PLLSAI2ClockOutCmd(uint32_t RCC_PLLSAI2ClockOut, FunctionalState NewState)
{
    __IO uint32_t tmp = 0;
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_RCC_PLLSAI2CLOCKOUT_VALUE(RCC_PLLSAI2ClockOut));

  tmp = PLLSAI2CFGR_PLLSAI2PEN_BB + RCC_PLLSAI2ClockOut;
  
  *(__IO uint32_t *) (tmp) = (uint32_t)NewState;   
    
}
/**
  * @brief  Enables or disables the Clock Security System on HSE.
  * @note   If a failure is detected on the HSE oscillator clock, this oscillator
  *         is automatically disabled and an interrupt is generated to inform the
  *         software about the failure (Clock Security System Interrupt, CSSI),
  *         allowing the MCU to perform rescue operations. The CSSI is linked to 
  *         the Cortex-M4 NMI (Non-Maskable Interrupt) exception vector.  
  * @param  NewState: new state of the Clock Security System on HSE.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSEClockSecuritySystemCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CR_HSECSSON_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the Clock Security System on LSE.
  * @note   If a failure is detected on the LSE oscillator clock, this oscillator
  *         is no more delivered to the RTC but no hardware action is done
  *         on the registers. If MSI was in PLL mode, this mode is disabled.
  *         In Standby mode a wakeup is generated, in other modes an interrupt
  *         can be send to wake-up the software
  * @param  NewState: new state of the Clock Security System on LSE.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_LSEClockSecuritySystemCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) BDCR_LSECSSON_BB = (uint32_t)NewState;
}

/**
  * @brief  Select the Clock source after wakeup from Stop mode.
  * @note   The selected clock is also used as emergency clock for the Clock 
  *         Security System on HSE. 
  * @note   Warning: STOPWUCK must not be modified when the Clock Security System 
  *         is enabled by HSECSSON in CR register and the system clock is HSE
  *        (SWS=”10”) or a switch on HSE is requested (SW=”10”)
  * @param  RCC_STOPWUCK_Clock: specifies the clock source after wake up from STOP mode
  *         This clock source can be the emergency clock for CSS.
  *         This parameter can be one of the following values:
  *            @arg RCC_STOPWUCK_MSI: MSI clock selected as STOPWUCK source
  *            @arg RCC_STOPWUCK_HSI: HSI clock selected as STOPWUCK source
  * @retval None
  */
void RCC_StopWakeUpClock(uint32_t RCC_STOPWUCK_Clock)
{
  /* Check the parameters */
  assert_param(IS_RCC_STOPWUP_VALUE(RCC_STOPWUCK_Clock));
  *(__IO uint32_t *) CFGR_STOPWUCK_BB = (uint32_t)RCC_STOPWUCK_Clock;
}

/**
  * @brief  Selects the clock source to output on MCO pin(PA8). 
  * @note   PA8 should be configured in alternate function mode.
  * @param  RCC_MCO1Source: specifies the clock source to output.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCOSource_SYSCLK: system  clock selected as MCO source
  *            @arg RCC_MCOSource_MSI: MSI clock selected as MCO source
  *            @arg RCC_MCOSource_HSI: HSI clock selected as MCO source
  *            @arg RCC_MCOSource_HSE: HSE clock selected as MCO source
  *            @arg RCC_MCOSource_HSE: HSE clock selected as MCO source
  *            @arg RCC_MCOSource_PLLCLK: main PLL clock selected as MCO source
  *            @arg RCC_MCOSource_LSI: LSI clock selected as MCO source
  *            @arg RCC_MCOSource_LSE: LSE clock selected as MCO source
  * @param  RCC_MC1Div: specifies the MCO prescaler.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCODiv_1: no division applied to MCO clock
  *            @arg RCC_MCODiv_2: division by 2 applied to MCO clock
  *            @arg RCC_MCODiv_4: division by 4 applied to MCO clock
  *            @arg RCC_MCODiv_8: division by 8 applied to MCO clock
  *            @arg RCC_MCODiv_16: division by 16 applied to MCO clock
  * @retval None
  */
void RCC_MCOConfig(uint32_t RCC_MCOSource, uint32_t RCC_MCODiv)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_RCC_MCOSOURCE(RCC_MCOSource));
  assert_param(IS_RCC_MCODIV(RCC_MCODiv));  

  tmpreg = RCC->CFGR;

