RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
  /* Clear MCO[1:0] and MCOPRE[2:0] bits */
  tmpreg &= CFGR_MCO_RESET_MASK;

  /* Select MCO clock source and prescaler */
  tmpreg |= RCC_MCOSource | RCC_MCODiv;

  /* Store the new value */
  RCC->CFGR = tmpreg;  
}


/** @defgroup RCC_Group2 System AHB and APB busses clocks configuration functions
 *  @brief   System, AHB and APB busses clocks configuration functions
 *
@verbatim   
 ===============================================================================
      ##### System, AHB and APB busses clocks configuration functions #####
 ===============================================================================  
    [..]
      This section provide functions allowing to configure the System, AHB, APB1 and 
      APB2 busses clocks.
  
      (#) Several clock sources can be used to drive the System clock (SYSCLK): MSI, HSI,
          HSE and PLL.
          The AHB clock (HCLK) is derived from System clock through configurable 
          prescaler and used to clock the CPU, memory and peripherals mapped 
          on AHB bus (DMA, GPIO...). APB1 (PCLK1) and APB2 (PCLK2) clocks are derived 
          from AHB clock through configurable prescalers and used to clock 
          the peripherals mapped on these busses. You can use 
          "RCC_GetClocksFreq()" function to retrieve the frequencies of these clocks.  

      -@- All the peripheral clocks are derived from the System clock (SYSCLK) except:
        (+@) The USB full speed clock (48 MHz) which is coming from a specific output 
             of three PLLs or from MSI.
        (+@) The SDIO and RNG are using the same 48MHz clock as the USB
        (+@) The SAI clocks which are coming from a specific output of the three PLLs. 
        (+@) The USART clocks which can be derived from the system clock or HSI or LSE
        (+@) the I2C clocks which can be derived from system clock or from HSI
        (+@) The Low Power Timer clock which can be derived from system clock or HSI or LSI or LSE
        (+@) The SAR ADC clock which is coming from a specific output of two PLLs or from 
             the system clock.
        (+@) The SWP clock can be derived from HSI
        (+@) The RTC in the Vswitch domain is clocked either by the external 32 kHz 
            oscillator present in the Vswitch domain,or by the internal RC 32 kHz , or by 
           the external oscillator (4-48 MHz) divided by 32 .
      (#) The maximum frequency of the SYSCLK and HCLK is 80 MHz, PCLK2 40 MHz 
          and PCLK1 20 MHz. Depending on the device voltage range, the maximum 
          frequency should be adapted accordingly:
 +-------------------------------------------------+     
 | Latency       |    HCLK clock frequency (MHz)   |
 |               |     VDD33 range: 1.6V-3.6V      |
 |               |---------------------------------|     
 |               | VDD12 range1   | VDD12 range2   | 
 |               |  1.08V-1.32V   | 0.90 V-1.10V   | 
 |---------------|----------------|----------------|            
 |0WS(1CPU cycle)|0 < HCLK <= 16  |0 < HCLK <= 6   |
 |---------------|----------------|----------------|
 |1WS(2CPU cycle)|16 < HCLK <= 32 |6 < HCLK <= 12  |
 |---------------|----------------|----------------| 
 |2WS(3CPU cycle)|32 < HCLK <= 48 |12 < HCLK <= 18 |
 |---------------|----------------|----------------|
 |3WS(4CPU cycle)|48 < HCLK <= 64 |18 < HCLK <= 24 |
 |---------------|----------------|----------------|
 |4WS(5CPU cycle)|64 < HCLK <= 80 |18 < HCLK <= 24 |
 |---------------|----------------|----------------| 

      -@- When VOSbit (in PWR_CR register) is reset to 0 , the maximum value of HCLK is 80 MHz.
          You can use PWR_MainRegulatorModeConfig() function to set or reset this bit.

@endverbatim
  * @{
  */

/**
  * @brief  Configures the system clock (SYSCLK).
  * @note   The MSI is used (enabled by hardware) as system clock source after
  *         startup from Reset, wake-up from STOP and STANDBY mode, or in case
  *         of failure of the HSE used directly or indirectly as system clock
  *         (if the Clock Security System CSS is enabled).
  * @note   A switch from one clock source to another occurs only if the target
  *         clock source is ready (clock stable after startup delay or PLL locked). 
  *         If a clock source which is not yet ready is selected, the switch will
  *         occur when the clock source will be ready. 
  *         You can use RCC_GetSYSCLKSource() function to know which clock is
  *         currently used as system clock source. 
  * @param  RCC_SYSCLKSource: specifies the clock source used as system clock.
  *          This parameter can be one of the following values:
  *            @arg RCC_SYSCLKSource_MSI:    MSI selected as system clock source
  *            @arg RCC_SYSCLKSource_HSI:    HSI selected as system clock source
  *            @arg RCC_SYSCLKSource_HSE:    HSE selected as system clock source
  *            @arg RCC_SYSCLKSource_PLLCLK: PLL selected as system clock source
  * @retval None
  */
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_SYSCLK_SOURCE(RCC_SYSCLKSource));

  tmpreg = RCC->CFGR;

  /* Clear SW[1:0] bits */
  tmpreg &= ~RCC_CFGR_SW;

  /* Set SW[1:0] bits according to RCC_SYSCLKSource value */
  tmpreg |= RCC_SYSCLKSource;

  /* Store the new value */
  RCC->CFGR = tmpreg;
}

/**
  * @brief  Returns the clock source used as system clock.
  * @param  None
  * @retval The clock source used as system clock. The returned value can be one
  *         of the following:
  *              - 0x00: MSI used as system clock
  *              - 0x04: HSI used as system clock
  *              - 0x08: HSE used as system clock
  *              - 0x0C: PLL used as system clock
  */
uint8_t RCC_GetSYSCLKSource(void)
{
  return ((uint8_t)(RCC->CFGR & RCC_CFGR_SWS));
}

/**
  * @brief  Configures the AHB clock (HCLK).
  * @note   Depending on the device voltage range, the software has to set correctly
  *         these bits to ensure that HCLK not exceed the maximum allowed frequency
  *         (for more details refer to section above
  *           "CPU, AHB and APB busses clocks configuration functions")
  * @param  RCC_SYSCLK: defines the AHB clock divider. This clock is derived from 
  *         the system clock (SYSCLK).
  *          This parameter can be one of the following values:
  *            @arg RCC_SYSCLK_Div1: AHB clock = SYSCLK
  *            @arg RCC_SYSCLK_Div2: AHB clock = SYSCLK/2
  *            @arg RCC_SYSCLK_Div4: AHB clock = SYSCLK/4
  *            @arg RCC_SYSCLK_Div8: AHB clock = SYSCLK/8
  *            @arg RCC_SYSCLK_Div16: AHB clock = SYSCLK/16
  *            @arg RCC_SYSCLK_Div64: AHB clock = SYSCLK/64
  *            @arg RCC_SYSCLK_Div128: AHB clock = SYSCLK/128
  *            @arg RCC_SYSCLK_Div256: AHB clock = SYSCLK/256
  *            @arg RCC_SYSCLK_Div512: AHB clock = SYSCLK/512
  * @retval None
  */
void RCC_HCLKConfig(uint32_t RCC_SYSCLK)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_RCC_HCLK(RCC_SYSCLK));

  tmpreg = RCC->CFGR;

  /* Clear HPRE[3:0] bits */
  tmpreg &= ~RCC_CFGR_HPRE;

  /* Set HPRE[3:0] bits according to RCC_SYSCLK value */
  tmpreg |= RCC_SYSCLK;

