RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
  /* Store the new value */
  RCC->CFGR = tmpreg;
}


/**
  * @brief  Configures the Low Speed APB clock (PCLK1).
  * @param  RCC_HCLK: defines the APB1 clock divider. This clock is derived from 
  *         the AHB clock (HCLK).
  *          This parameter can be one of the following values:
  *            @arg RCC_HCLK_Div1:  APB1 clock = HCLK
  *            @arg RCC_HCLK_Div2:  APB1 clock = HCLK/2
  *            @arg RCC_HCLK_Div4:  APB1 clock = HCLK/4
  *            @arg RCC_HCLK_Div8:  APB1 clock = HCLK/8
  *            @arg RCC_HCLK_Div16: APB1 clock = HCLK/16
  * @retval None
  */
void RCC_PCLK1Config(uint32_t RCC_HCLK)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PCLK(RCC_HCLK));

  tmpreg = RCC->CFGR;

  /* Clear PPRE1[2:0] bits */
  tmpreg &= ~RCC_CFGR_PPRE1;

  /* Set PPRE1[2:0] bits according to RCC_HCLK value */
  tmpreg |= RCC_HCLK;

  /* Store the new value */
  RCC->CFGR = tmpreg;
}

/**
  * @brief  Configures the High Speed APB clock (PCLK2).
  * @param  RCC_HCLK: defines the APB2 clock divider. This clock is derived from 
  *         the AHB clock (HCLK).
  *          This parameter can be one of the following values:
  *            @arg RCC_HCLK_Div1:  APB2 clock = HCLK
  *            @arg RCC_HCLK_Div2:  APB2 clock = HCLK/2
  *            @arg RCC_HCLK_Div4:  APB2 clock = HCLK/4
  *            @arg RCC_HCLK_Div8:  APB2 clock = HCLK/8
  *            @arg RCC_HCLK_Div16: APB2 clock = HCLK/16
  * @retval None
  */
void RCC_PCLK2Config(uint32_t RCC_HCLK)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PCLK(RCC_HCLK));

  tmpreg = RCC->CFGR;

  /* Clear PPRE2[2:0] bits */
  tmpreg &= ~RCC_CFGR_PPRE2;

  /* Set PPRE2[2:0] bits according to RCC_HCLK value */
  tmpreg |= RCC_HCLK << 3;

  /* Store the new value */
  RCC->CFGR = tmpreg;
}

/**
  * @brief  Returns the frequencies of different on chip clocks;  System, AHB, APB2 
  *   and APB1 busses clocks,  USART1/2/3/4/5 /6 clocks, I2C1/2 clocks.
  * @note   The system frequency computed by this function is not the real 
  *         frequency in the chip. It is calculated based on the predefined 
  *         constant and the selected clock source:
  * @note     If SYSCLK source is MSI, function returns values based on MSI_VALUE(*)
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(**)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(***)
  * @note     If SYSCLK source is PLL, function returns values based on HSE_VALUE(***) 
  *           or HSI_VALUE(**) or MSI_VALUE(*) multiplied/divided by the PLL factors.
  * @note     (*) MSI_VALUE is a constant defined in stm32l4xx.h file (default value
  *               4 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) HSI_VALUE is a constant defined in stm32l4xx.h file (default value
  *               16 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (***) HSE_VALUE is a constant defined in stm32l4xx.h file (default value
  *                25 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *                
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *   
  * @param  RCC_Clocks: pointer to a RCC_ClocksTypeDef structure which will hold
  *          the clocks frequencies.
  *     
  * @note   This function can be used by the user application to compute the 
  *         baudrate for the communication peripherals or configure other parameters.
  * @note   Each time SYSCLK, HCLK, PCLK1 and/or PCLK2 clock changes, this function
  *         must be called to update the structure's field. Otherwise, any
  *         configuration based on this function will be incorrect.
  *    
  * @retval None
  */
// void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks)
// {
//   uint32_t tmp = 0, msirange = 0, presc = 0, pllvco = 0, pllr = 2, pllsource = 0, pllm = 2;

//   /* Get SYSCLK source -------------------------------------------------------*/
//   tmp = RCC->CFGR & RCC_CFGR_SWS;
//   
//   msirange=(RCC->CR & RCC_CR_MSIRANGE)>> 4 ; 
//   /*MSI frequency range in HZ*/
//   msirange = MSIRangeTable[msirange];
//   
//   switch (tmp)
//   {
//   case 0x00:  /* MSI used as system clock source */
//     RCC_Clocks->SYSCLK_Frequency = msirange;
//     break;
//   case 0x04:  /* HSI used as system clock  source */
//     RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
//     break;
//     
//   case 0x08:  /* HSE used as system clock  source */
//     RCC_Clocks->SYSCLK_Frequency = HSE_VALUE;
//     break;
//     
//   case 0x0C:  /* PLL used as system clock  source */
//     
//     /* PLL_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLLM) * PLLN
//     SYSCLK = PLL_VCO / PLLR
//     */    
//     pllsource = (RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC);
//     pllm = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLM)>> 4) + 1 ;
//     
//     
//     switch (pllsource)
//     {
//     case 0x01:  /* MSI used as PLL clock source */
//       pllvco = (msirange / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 8);
//       break;
//       
//     case 0x02:  /* HSI used as PLL clock source */
//       pllvco = (HSI_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 8);
//       break;
//       
//     case 0x03:  /* HSE used as PLL clock source */
//       pllvco = (HSE_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 8);
//       break;
//       
//     default:
//       pllvco = (msirange / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 8);
//       break;
//     }
//     pllr = (((RCC->PLLCFGR & RCC_PLLCFGR_PLLR) >>25) + 1 ) *2;
//     RCC_Clocks->SYSCLK_Frequency = pllvco/pllr;
//     break;
//   default:
//     RCC_Clocks->SYSCLK_Frequency = msirange;
//     break;
//   }
//   /* Compute HCLK, PCLK1 and PCLK2 clocks frequencies ------------------------*/
//     
//   /* Get HCLK prescaler */
//   tmp = RCC->CFGR & RCC_CFGR_HPRE;
//   tmp = tmp >> 4;
//   presc = APBAHBPrescTable[tmp];
//   /* HCLK clock frequency */
//   RCC_Clocks->HCLK_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc;

//   /* Get PCLK1 prescaler */
//   tmp = RCC->CFGR & RCC_CFGR_PPRE1;
//   tmp = tmp >> 8;
//   presc = APBAHBPrescTable[tmp];
//   /* PCLK1 clock frequency */
//   RCC_Clocks->PCLK1_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

//   /* Get PCLK2 prescaler */
//   tmp = RCC->CFGR & RCC_CFGR_PPRE2;
//   tmp = tmp >> 11;
//   presc = APBAHBPrescTable[tmp];
//   /* PCLK2 clock frequency */
//   RCC_Clocks->PCLK2_Frequency = RCC_Clocks->HCLK_Frequency >> presc;
//   
//   /* USART1CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_USART1SEL) == 0x0)
//   {
//     /* USART Clock is PCLK */
//     RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->PCLK2_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART1SEL) ==  RCC_CCIPR_USART1SEL_0)
//   {
//     /* USART Clock is System Clock */
//     RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART1SEL) ==  RCC_CCIPR_USART1SEL_1)
//   {
//     /* USART Clock is HSI Osc. */
//     RCC_Clocks->USART1CLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART1SEL) ==  RCC_CCIPR_USART1SEL)
//   {
//     /* USART Clock is LSE Osc. */
//     RCC_Clocks->USART1CLK_Frequency = LSE_VALUE;
//   }
//   
//   /* USART2CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_USART2SEL) == 0x0)
//   {
//     /* USART Clock is PCLK */
//     RCC_Clocks->USART2CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART2SEL) ==  RCC_CCIPR_USART2SEL_0)
//   {
//     /* USART Clock is System Clock */
//     RCC_Clocks->USART2CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART2SEL) ==  RCC_CCIPR_USART2SEL_1)
//   {
//     /* USART Clock is HSI Osc. */
//     RCC_Clocks->USART2CLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART2SEL) ==  RCC_CCIPR_USART2SEL)
//   {
//     /* USART Clock is LSE Osc. */
//     RCC_Clocks->USART2CLK_Frequency = LSE_VALUE;
//   }
//   
//   /* USART3CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_USART3SEL) == 0x0)
//   {
//     /* USART Clock is PCLK */
//     RCC_Clocks->USART3CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART3SEL) ==  RCC_CCIPR_USART3SEL_0)
//   {
//     /* USART Clock is System Clock */
//     RCC_Clocks->USART3CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART3SEL) ==  RCC_CCIPR_USART3SEL_1)
//   {
//     /* USART Clock is HSI Osc. */
//     RCC_Clocks->USART3CLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_USART3SEL) ==  RCC_CCIPR_USART3SEL)
//   {
//     /* USART Clock is LSE Osc. */
//     RCC_Clocks->USART3CLK_Frequency = LSE_VALUE;
//   }
//   
//   /* UART4CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_UART4SEL) == 0x0)
//   {
//     /* UART Clock is PCLK */
//     RCC_Clocks->UART4CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART4SEL) ==  RCC_CCIPR_UART4SEL_0)
//   {
//     /* UART Clock is System Clock */
//     RCC_Clocks->UART4CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART4SEL) ==  RCC_CCIPR_UART4SEL_1)
//   {
//     /* UART Clock is HSI Osc. */
//     RCC_Clocks->UART4CLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART4SEL) ==  RCC_CCIPR_UART4SEL)
//   {
//     /* UART Clock is LSE Osc. */
//     RCC_Clocks->UART4CLK_Frequency = LSE_VALUE;
//   }
//   
//   /* UART5CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_UART5SEL) == 0x0)
//   {
//     /* UART Clock is PCLK */
//     RCC_Clocks->UART5CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART5SEL) ==  RCC_CCIPR_UART5SEL_0)
//   {
//     /* UART Clock is System Clock */
//     RCC_Clocks->UART5CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART5SEL) ==  RCC_CCIPR_UART5SEL_1)
//   {
//     /* UART Clock is HSI Osc. */
//     RCC_Clocks->UART5CLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_UART5SEL) ==  RCC_CCIPR_UART5SEL)
//   {
//     /* UART Clock is LSE Osc. */
//     RCC_Clocks->UART5CLK_Frequency = LSE_VALUE;
//   }
//   
//   /* LPUARTCLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_LPUARTSEL) == 0x0)
//   {
//     /* LPUART Clock is PCLK */
//     RCC_Clocks->LPUARTCLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_LPUARTSEL) ==  RCC_CCIPR_LPUARTSEL_0)
//   {
//     /* LPUART Clock is System Clock */
//     RCC_Clocks->LPUARTCLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_LPUARTSEL) ==  RCC_CCIPR_LPUARTSEL_1)
//   {
//     /* LPUART Clock is HSI Osc. */
//     RCC_Clocks->LPUARTCLK_Frequency = HSI_VALUE;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_LPUARTSEL) ==  RCC_CCIPR_LPUARTSEL)
//   {
//     /* LPUART Clock is LSE Osc. */
//     RCC_Clocks->LPUARTCLK_Frequency = LSE_VALUE;
//   }
//   
//   /* I2C1 CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_I2C1SEL) == 0x0)
//   {
//     /* I2C1 Clock is PCLK */
//     RCC_Clocks->I2C1CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C1SEL) ==  RCC_CCIPR_I2C1SEL_0)
//   {
//     /* I2C1 Clock is System Clock */
//     RCC_Clocks->I2C1CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C1SEL) ==  RCC_CCIPR_I2C1SEL_1)
//   {
//     /* I2C1 Clock is HSI Osc. */
//     RCC_Clocks->I2C1CLK_Frequency = HSI_VALUE;
//   }
//   
//   /* I2C2 CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_I2C2SEL) == 0x0)
//   {
//     /* I2C2 Clock is PCLK */
//     RCC_Clocks->I2C2CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C2SEL) ==  RCC_CCIPR_I2C2SEL_0)
//   {
//     /* I2C2 Clock is System Clock */
//     RCC_Clocks->I2C2CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C2SEL) ==  RCC_CCIPR_I2C2SEL_1)
//   {
//     /* I2C2 Clock is HSI Osc. */
//     RCC_Clocks->I2C2CLK_Frequency = HSI_VALUE;
//   }
//  
//   /* I2C3 CLK clock frequency */
//   if((RCC->CCIPR &  RCC_CCIPR_I2C3SEL) == 0x0)
//   {
//     /* I2C3 Clock is PCLK */
//     RCC_Clocks->I2C3CLK_Frequency = RCC_Clocks->PCLK1_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C3SEL) ==  RCC_CCIPR_I2C3SEL_0)
//   {
//     /* I2C3 Clock is System Clock */
//     RCC_Clocks->I2C3CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
//   }
//   else if((RCC->CCIPR &  RCC_CCIPR_I2C3SEL) ==  RCC_CCIPR_I2C3SEL_1)
//   {
//     /* I2C3 Clock is HSI Osc. */
//     RCC_Clocks->I2C3CLK_Frequency = HSI_VALUE;
//   }
//  
//   
// }

/**
  * @}
  */

