RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
/** @defgroup RCC_Group3 Peripheral clocks configuration functions
 *  @brief   Peripheral clocks configuration functions 
 *
@verbatim   
 ===============================================================================
              ##### Peripheral clocks configuration functions #####
 ===============================================================================  
    [..] This section provide functions allowing to configure the Peripheral clocks. 
  
      (#) The RTC clock which is derived from the LSI, LSE or HSE clock divided 
          by 2 to 31.
     
      (#) After restart from Reset or wakeup from STANDBY, all peripherals are off
          except internal SRAM, Flash and JTAG. Before to start using a peripheral 
          you have to enable its interface clock. You can do this using 
          RCC_AHB1PeriphClockCmd(), RCC_AHB2PeriphClockCmd(),RCC_AHB3PeriphClockCmd(),
          RCC_APB1LPeriphClockCmd(), RCC_APB1HPeriphClockCmd()
          and RCC_APB2PeriphClockCmd() functions.

      (#) To reset the peripherals configuration (to the default state after device reset)
          you can use RCC_AHB1PeriphResetCmd(), RCC_AHB2PeriphResetCmd(),
          RCC_AHB3PeriphResetCmd(), RCC_APB1LPeriphResetCmd(), RCC_APB1HPeriphResetCmd()
          and RCC_APB2PeriphResetCmd() functions.
     
      (#) To further reduce power consumption in SLEEP mode the peripheral clocks 
          can be disabled prior to executing the WFI or WFE instructions. 
          You can do this using RCC_AHB1PeriphClockLPModeCmd(), RCC_AHB2PeriphClockLPModeCmd(),
          RCC_AHB3PeriphClockLPModeCmd(), RCC_APB2PeriphClockLPModeCmd(),
          RCC_APB1LPeriphClockLPModeCmd(), RCC_APB1HPeriphClockLPModeCmd() functions.  

@endverbatim
  * @{
  */

/**
  * @brief  Configures the RTC clock (RTCCLK).
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is denied to this domain after reset, you have to enable write
  *         access using PWR_BackupAccessCmd(ENABLE) function before to configure
  *         the RTC clock source (to be done once after reset).    
  * @note   Once the RTC clock is configured it can't be changed unless the  
  *         Backup domain is reset using RCC_BackupResetCmd() function, or by
  *         a Power On Reset (POR).
  *    
  * @param  RCC_RTCCLKSource: specifies the RTC clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_RTCCLKSource_LSE: LSE selected as RTC clock
  *            @arg RCC_RTCCLKSource_LSI: LSI selected as RTC clock
  *            @arg RCC_RTCCLKSource_HSE: HSE clock divided by 32.
  *  
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wakeup source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.    
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  *  
  * @retval None
  */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{

  /* Check the parameters */
  assert_param(IS_RCC_RTCCLK_SOURCE(RCC_RTCCLKSource));


  RCC->BDCR &= ~RCC_BDCR_RTCSEL;
  
  /* Select the RTC clock source */
  RCC->BDCR |= RCC_RTCCLKSource;
  
}

/**
  * @brief  Enables or disables the RTC clock.
  * @note   This function must be used only after the RTC clock source was selected
  *         using the RCC_RTCCLKConfig function.
  * @param  NewState: new state of the RTC clock. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_RTCCLKCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) BDCR_RTCEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Forces or releases the Backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCC_CSR register.
  * @note   The BKPSRAM is not affected by this reset.    
  * @param  NewState: new state of the Backup domain reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_BackupResetCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) BDCR_BDRST_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the DFSDM clock source (DFSDMCLK).
  * @note   This function must be called before enabling the DFSDM APB clock.
  * @param  RCC_DFSDMCLKSource: specifies the DFSDM clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DFSDMCLKSource_APB: APB clock used as DFSDM clock source.
  *            @arg RCC_DFSDMCLKSource_SYS: System clock used as DFSDM clock source.
  *                                        
  * @retval None
  */
void RCC_DFSDMCLKConfig(uint32_t RCC_DFSDMCLKSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_DFSDMCLK_SOURCE(RCC_DFSDMCLKSource));
  *(__IO uint32_t *) CCIPR_DFSDMSRC_BB = RCC_DFSDMCLKSource;
}

/**
  * @brief  Configures the I2C clock (I2CCLK).
  * @param  RCC_I2CCLK: defines the I2C clock source. This clock is derived 
  *         from the HSI, PCLK or System clock.
  *          This parameter can be one of the following values:
  *             @arg RCC_I2CxCLK_PCLK: I2Cx clock = APB Clock (PCLK)  
  *             @arg RCC_I2CxCLK_HSI: I2Cx clock = HSI
  *             @arg RCC_I2CxCLK_SYSCLK: I2Cx clock = System Clock
  * @note  x can be 1, 2 or 3  
  * @retval None
  */
void RCC_I2CCLKConfig(uint32_t RCC_I2CCLK)
{ 
  uint32_t tmp = 0,tmp_CCIPR;
  
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Check the parameters */
  assert_param(IS_RCC_I2CCLK(RCC_I2CCLK));

  tmp = (RCC_I2CCLK >> 28);
  
  /* Check which I2C Instance is called */
  switch (tmp)
  {
    case 0x01:
      /* Clear I2C1_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_I2C1SEL;
      break;
    case 0x02:
      /* Clear I2C2_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_I2C2SEL;
      break;
    case 0x03:
      /* Clear I2C3_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_I2C3SEL;
      break;
  default:
    break;
  }
  /* Update New Value */
  tmp_CCIPR |= 0x0003F000 & RCC_I2CCLK;
  /* Set I2CxSEL bits according to RCC_I2CCLK value */
  RCC->CCIPR = tmp_CCIPR;
}

/**
  * @brief  Configures the USART clock (USARTCLK).
  * @param  RCC_USARTCLK: defines the USART clock source. This clock is derived 
  *         from the HSI, PCLK, LSE or System clock.
  *          This parameter can be one of the following values:
  *             @arg RCC_PPPCLK_PCLK: USART clock = APB Clock (PCLK)
  *             @arg RCC_PPPCLK_SYSCLK: USART clock = System Clock
  *             @arg RCC_PPPCLK_LSE: USART clock = LSE Clock
  *             @arg RCC_PPPCLK_HSI: USART clock = HSI Clock
  * @note  PPP can be USART1, USART2, USART3, UART4, UART5 or LPUART  
  * @retval None
  */
void RCC_USARTCLKConfig(uint32_t RCC_USARTCLK)
{ 
  uint32_t tmp = 0,tmp_CCIPR;
  
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Check the parameters */
  assert_param(IS_RCC_USARTCLK(RCC_USARTCLK));

  tmp = (RCC_USARTCLK >> 28);

