RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
  /* Check which USART instance is Called */
  switch (tmp)
  {
    case 0x01:
      /* Clear USART1_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_USART1SEL;
      break;
    case 0x02:
      /* Clear USART2_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_USART2SEL;
      break;
    case 0x03:
      /* Clear USART3_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_USART3SEL;
      break;
    case 0x04:
      /* Clear UART4_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_UART4SEL;
      break;
    case 0x05:
      /* Clear UART5_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_UART5SEL;
      break;
    case 0x06:
      /* Clear LPUART_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_LPUARTSEL;
      break;
  default:
    break;
  }
  /* Update New Value */
  tmp_CCIPR |= 0x00000FFF & RCC_USARTCLK;
  /* Set USARTxSEL bits according to RCC_USARTCLK value */
  RCC->CCIPR = tmp_CCIPR;
}

/**
  * @brief  Configures the ADC clock source.
  * @param  RCC_ADCCLKSource: defines the ADC clock source. This clock is derived 
  *         from the PLL_SAI1, PLL_SAI2 or System clock.
  *         This parameter can be one of the following values:
  *             @arg RCC_ADCCLKSource_PLLSAI1: ADC clock = PLL_SAI1  
  *             @arg RCC_ADCCLKSource_PLLSAI2: ADC clock = PLL_SAI1
  *             @arg RCC_ADCCLKSource_SYSCLK:  ADC clock = System Clock
  * @retval None
  */
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLKSource)
{ 
  uint32_t tmp_CCIPR =0 ;
  
   /* Check the parameters */
  assert_param(IS_RCC_ADC_CLOCK(RCC_ADCCLKSource));
  
  /* Gets CCIPR register value */
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Clear ADC_SEL Bits */
  tmp_CCIPR &= ~RCC_CCIPR_ADCSEL;

  /* Update New Value */
  tmp_CCIPR |= RCC_ADCCLKSource;
  
  /* Set ADCSEL bits according to RCC_ADCCLKSource value */ 
  RCC->CCIPR = tmp_CCIPR;
}

/**
  * @brief  Configures the LPTIM clock source.
  * @param  RCC_LPTIMxCLKSource: defines the LPTIM clock source. This clock is
  *         derived from the APB, LSI, HSI or LSE.
  *         This parameter can be one of the following values:
  *             @arg RCC_LPTIMxCLKSource_APB: LPTIMx clock = APB Clock  
  *             @arg RCC_LPTIMxCLKSource_LSI: LPTIMx clock = LSI clock
  *             @arg RCC_LPTIMxCLKSource_HSI: LPTIMx clock = HSI Clock
  *             @arg RCC_LPTIMxCLKSource_LSE: LPTIMx clock = LSE Clock 
  * @note  x can be 1 or 2 to select the LPTIM peripheral.  
  * @retval None
  */
void RCC_LPTIMCLKConfig(uint32_t RCC_LPTIMxCLKSource)
{ 
  uint32_t tmp = 0, tmp_CCIPR;
  
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Check the parameters */
  assert_param(IS_RCC_LPTIM(RCC_LPTIMxCLKSource));

  tmp = (RCC_LPTIMxCLKSource >> 28);
  
  /* Check which LPTIM Instance is called */
  switch (tmp)
  {
    case 0x01:
      /* Clear LPTIM1_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_LPTIM1SEL;
      break;
    case 0x02:
      /* Clear LPTIM2_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_LPTIM2SEL;
      break;
    default:
      break;
  }
  /* Update New Value */
  tmp_CCIPR |= (0x003C0000 & RCC_LPTIMxCLKSource);
  
  /* Set LPTIMxSEL bits according to RCC_LPTIMxCLKSource value */
  RCC->CCIPR = tmp_CCIPR;
}

void RCC_SWPCLKConfig(uint32_t RCC_SWPCLKSource);

/**
  * @brief  Configures the SWP clock (SWPCLK).
  * @param  RCC_SWPCLK: defines the SWP clock source. This clock is derived 
  *         from the PCLK or System clock.
  *          This parameter can be one of the following values:
  *             @arg RCC_SWPCLK_APB: SWP clock = APB Clock (PCLK)  
  *             @arg RCC_SWPCLK_HSI: SWP clock = HSI
  * @retval None
  */
void RCC_SWPCLKConfig(uint32_t RCC_SWPCLKSource)
{ 

   /* Check the parameters */
  assert_param(IS_RCC_SWPCLK_SOURCE(RCC_SWPCLKSource));
  *(__IO uint32_t *) CCIPR_SWPSRC_BB = RCC_SWPCLKSource;
  
}


/**
  * @brief  Configures the SAI clock (SAICLKSource).
  * @param  RCC_SAICLKSource: defines the SAI clock source. This clock is derived 
  *         from the PLLSAIx, system PLL or external clock (through a dedicated PIN)
  *          This parameter can be one of the following values:
  *             @arg RCC_SAI1CLK_PLLSAI1: SAIx clock = PLLSAI1  
  *             @arg RCC_SAI1CLK_PLLSAI2: SAIx clock = PLLSAI2  
  *             @arg RCC_SAI1CLK_PLLSYS: SAIx clock  = PLLSYS  
  *             @arg RCC_SAI1CLK_PIN: SAIx clock = External Clock  
  *             @arg RCC_SAI2CLK_PLLSAI1: SAIx clock = PLLSAI1  
  *             @arg RCC_SAI2CLK_PLLSAI2: SAIx clock = PLLSAI2  
  *             @arg RCC_SAI2CLK_PLLSYS: SAIx clock  = PLLSYS  
  *             @arg RCC_SAI2CLK_PIN: SAIx clock = External Clock
  * @note  x can be 1or 2   
  * @retval None
  */
void RCC_SAICLKConfig(uint32_t RCC_SAICLKSource)
{ 
  uint32_t tmp = 0,tmp_CCIPR;
  
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Check the parameters */
  assert_param(IS_RCC_SAICLK(RCC_SAICLKSource));

  tmp = (RCC_SAICLKSource >> 28);
  
  /* Check which SAI Instance is called */
  switch (tmp)
  {
    case 0x01:
      /* Clear SAI1_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_SAI1SEL;
      break;
    case 0x02:
      /* Clear SAI2_SEL Bits */
      tmp_CCIPR &= ~RCC_CCIPR_SAI2SEL;
      break;
  
  default:
    break;
  }
  /* Update New Value */
  tmp_CCIPR |= 0x03C00000 & RCC_SAICLKSource;
  /* Set SAIxSEL bits according to RCC_SAICLKSource value */
  RCC->CCIPR = tmp_CCIPR;
}


/**
  * @brief  48 MHz clock source selection
  * @param  RCC_48CLKSource: defines the 48MHz clock source. This clock is derived 
  *         from the PLL_SAI1, PLL_SAI2 or System clock.
  *         This parameter can be one of the following values:
  *             @arg RCC_CLK48Source_PLLSAI1: CLK48 clock = PLL_SAI1 Clock 
  *             @arg RCC_CLK48Source_PLLSYS: CLK48 clock = PLL_SYS Clock
  *             @arg RCC_CLK48Source_MSICLK: CLK48 clock = MSI Clock
  * @retval None
  */
void RCC_CLK48Config(uint32_t RCC_CLK48Source)
{ 
  
  uint32_t tmp_CCIPR =0 ;
  
  /* Check the parameters */
  assert_param(IS_RCC_CLK48(RCC_CLK48Source));
  
  /* Gets CCIPR register value */
  tmp_CCIPR = RCC->CCIPR ;
  
  /* Clear CLK48_SEL Bits */
  tmp_CCIPR &= ~RCC_CCIPR_CLK48SEL;

  /* Update New Value */
  tmp_CCIPR |= RCC_CLK48Source;
  
  /* Set CLK48SEL bits according to RCC_CLK48Source value */ 
  RCC->CCIPR = tmp_CCIPR;
}


/**
  * @brief  Enables or disables the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it.   
  * @param  RCC_AHB1Periph: specifies the AHB1 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_AHB1Periph_DMA1         DMA1 clock    
  *            @arg RCC_AHB1Periph_DMA2         DMA2 clock   
  *            @arg RCC_AHB1Periph_TSC          TSC clock   
  *            @arg RCC_AHB1Periph_FLASH        Flash clock 
  *            @arg RCC_AHB1Periph_CRC          CRC clock    
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB1PeriphClockCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB1_CLOCK_PERIPH(RCC_AHB1Periph));

  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->AHB1ENR |= RCC_AHB1Periph;
  }
  else
  {
    RCC->AHB1ENR &= ~RCC_AHB1Periph;
  }
}

/**
  * @brief  Enables or disables the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it. 
  * @param  RCC_AHB2Periph: specifies the AHB2 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_AHB2Periph_GPIOA:       GPIOA clock
  *            @arg RCC_AHB2Periph_GPIOB:       GPIOB clock 
  *            @arg RCC_AHB2Periph_GPIOC:       GPIOC clock
  *            @arg RCC_AHB2Periph_GPIOD:       GPIOD clock
  *            @arg RCC_AHB2Periph_GPIOE:       GPIOE clock
  *            @arg RCC_AHB2Periph_GPIOF:       GPIOF clock
  *            @arg RCC_AHB2Periph_GPIOG:       GPIOG clock
  *            @arg RCC_AHB2Periph_GPIOH:       GPIOH clock
  *            @arg RCC_AHB2Periph_OTGFS:       USB OTG Full Speed clock
  *            @arg RCC_AHB2Periph_ADC:         ADCs clock
  *            @arg RCC_AHB2Periph_AES:         AES clock
  *            @arg RCC_AHB2Periph_RNG:         RNG clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB2PeriphClockCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB2_PERIPH(RCC_AHB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->AHB2ENR |= RCC_AHB2Periph;
  }
  else
  {
    RCC->AHB2ENR &= ~RCC_AHB2Periph;
  }
}

/**
  * @brief  Enables or disables the AHB3 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it. 
  * @param  RCC_AHB3Periph: specifies the AHB3 peripheral to gates its clock.
  *          This parameter must be: RCC_AHB3Periph_FMC or RCC_AHB3Periph_QSPI 
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB3PeriphClockCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB3_PERIPH(RCC_AHB3Periph));  
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->AHB3ENR |= RCC_AHB3Periph;
  }
  else
  {
    RCC->AHB3ENR &= ~RCC_AHB3Periph;
  }
}

/**
  * @brief  Enables or disables the Low Speed APB (APB1L) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it. 
  * @param  RCC_APB1LPeriph: specifies the APB1L peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1LPeriph_TIM2:   TIM2 clock
  *            @arg RCC_APB1LPeriph_TIM3:   TIM3 clock
  *            @arg RCC_APB1LPeriph_TIM4:   TIM4 clock
  *            @arg RCC_APB1LPeriph_TIM5:   TIM5 clock
  *            @arg RCC_APB1LPeriph_TIM6:   TIM6 clock
  *            @arg RCC_APB1LPeriph_TIM7:   TIM7 clock
  *            @arg RCC_APB1LPeriph_LCD:    LCD clock
  *            @arg RCC_APB1LPeriph_WWDG:   WWDG clock
  *            @arg RCC_APB1LPeriph_SPI2:   SPI2 clock
  *            @arg RCC_APB1LPeriph_SPI3:   SPI3 clock
  *            @arg RCC_APB1LPeriph_USART2: USART2 clock
  *            @arg RCC_APB1LPeriph_USART3: USART3 clock
  *            @arg RCC_APB1LPeriph_UART4:  UART4 clock
  *            @arg RCC_APB1LPeriph_UART5:  UART5 clock
  *            @arg RCC_APB1LPeriph_I2C1:   I2C1 clock
  *            @arg RCC_APB1LPeriph_I2C2:   I2C2 clock
  *            @arg RCC_APB1LPeriph_I2C3:   I2C3 clock
  *            @arg RCC_APB1LPeriph_CAN:    CAN clock
  *            @arg RCC_APB1LPeriph_PWR:    PWR clock
  *            @arg RCC_APB1LPeriph_DAC:    DAC clock
  *            @arg RCC_APB1LPeriph_OPAMP:  OPAMP clock
  *            @arg RCC_APB1LPeriph_LPTIM1: LPTIM1 clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1LPeriphClockCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1L_PERIPH(RCC_APB1LPeriph));  
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->APB1LENR |= RCC_APB1LPeriph;
  }
  else
  {
    RCC->APB1LENR &= ~RCC_APB1LPeriph;
  }
}

/**
  * @brief  Enables or disables the Low Speed APB (APB1H) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it. 
  * @param  RCC_APB1HPeriph: specifies the APB1H peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1HPeriph_LPUART: LPUART clock
  *            @arg RCC_APB1HPeriph_SWP:    SWP clock
  *            @arg RCC_APB1HPeriph_LPTIM2: LPTIM2 clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1HPeriphClockCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1H_PERIPH(RCC_APB1HPeriph));  
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->APB1HENR |= RCC_APB1HPeriph;
  }
  else
  {
    RCC->APB1HENR &= ~RCC_APB1HPeriph;
  }
}

/**
  * @brief  Enables or disables the High Speed APB (APB2) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before 
  *         using it.
  * @param  RCC_APB2Periph: specifies the APB2 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB2Periph_SYSCFG:    SYSCFG clock
  *            @arg RCC_APB2Periph_COMP:      COMP clock
  *            @arg RCC_APB2Periph_FIREWALL:  FIREWALL clock
  *            @arg RCC_APB2Periph_SDIO:      SDIO clock
  *            @arg RCC_APB2Periph_TIM1:      TIM1 clock
  *            @arg RCC_APB2Periph_SPI1:      SPI1 clock
  *            @arg RCC_APB2Periph_TIM8:      TIM8 clock
  *            @arg RCC_APB2Periph_USART1:    USART1clock
  *            @arg RCC_APB2Periph_TIM15:     TIM15 clock
  *            @arg RCC_APB2Periph_TIM16:     TIM16 clock
  *            @arg RCC_APB2Periph_TIM17:     TIM17 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI1 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI2 clock
  *            @arg RCC_APB2Periph_DFSDM:     DFSDM clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB2_PERIPH(RCC_APB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->APB2ENR |= RCC_APB2Periph;
  }
  else
  {
    RCC->APB2ENR &= ~RCC_APB2Periph;
  }
}

/**
  * @brief  Forces or releases AHB1 peripheral reset.
  * @param  RCC_AHB1Periph: specifies the AHB1 peripheral to reset.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_AHB1Periph_DMA1         DMA1 clock    
  *            @arg RCC_AHB1Periph_DMA2         DMA2 clock   
  *            @arg RCC_AHB1Periph_TSC          TSC clock   
  *            @arg RCC_AHB1Periph_FLASH        Flash clock 
  *            @arg RCC_AHB1Periph_CRC          CRC clock    
  *                  
  * @param  NewState: new state of the specified peripheral reset.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB1PeriphResetCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB1_CLOCK_PERIPH(RCC_AHB1Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->AHB1RSTR |= RCC_AHB1Periph;
  }
  else
  {
    RCC->AHB1RSTR &= ~RCC_AHB1Periph;
  }
}

/**
  * @brief  Forces or releases AHB2 peripheral reset.
  * @param  RCC_AHB2Periph: specifies the AHB2 peripheral to reset.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_AHB2Periph_GPIOA:       GPIOA clock
  *            @arg RCC_AHB2Periph_GPIOB:       GPIOB clock 
  *            @arg RCC_AHB2Periph_GPIOC:       GPIOC clock
  *            @arg RCC_AHB2Periph_GPIOD:       GPIOD clock
  *            @arg RCC_AHB2Periph_GPIOE:       GPIOE clock
  *            @arg RCC_AHB2Periph_GPIOF:       GPIOF clock
  *            @arg RCC_AHB2Periph_GPIOG:       GPIOG clock
  *            @arg RCC_AHB2Periph_GPIOH:       GPIOH clock
  *            @arg RCC_AHB2Periph_OTGFS:       USB OTG Full Speed clock
  *            @arg RCC_AHB2Periph_ADC:         ADCs clock
  *            @arg RCC_AHB2Periph_AES:         AES clock
  *            @arg RCC_AHB2Periph_RNG:         RNG clock
  * @param  NewState: new state of the specified peripheral reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB2PeriphResetCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB2_PERIPH(RCC_AHB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->AHB2RSTR |= RCC_AHB2Periph;
  }
  else
  {
    RCC->AHB2RSTR &= ~RCC_AHB2Periph;
  }
}

/**
  * @brief  Forces or releases AHB3 peripheral reset.
  * @param  RCC_AHB3Periph: specifies the AHB3 peripheral to reset.
  *          This parameter must be: RCC_AHB3Periph_FMC or RCC_AHB3Periph_QSPI  
  * @param  NewState: new state of the specified peripheral reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB3PeriphResetCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB3_PERIPH(RCC_AHB3Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    RCC->AHB3RSTR |= RCC_AHB3Periph;
  }
  else
  {
    RCC->AHB3RSTR &= ~RCC_AHB3Periph;
  }
}

/**
  * @brief  Forces or releases Low Speed APB (APB1L) peripheral reset.
  * @param  RCC_APB1LPeriph: specifies the APB1 peripheral to reset.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1LPeriph_TIM2:   TIM2 clock
  *            @arg RCC_APB1LPeriph_TIM3:   TIM3 clock
  *            @arg RCC_APB1LPeriph_TIM4:   TIM4 clock
  *            @arg RCC_APB1LPeriph_TIM5:   TIM5 clock
  *            @arg RCC_APB1LPeriph_TIM6:   TIM6 clock
  *            @arg RCC_APB1LPeriph_TIM7:   TIM7 clock
  *            @arg RCC_APB1LPeriph_LCD:    LCD clock
  *            @arg RCC_APB1LPeriph_SPI2:   SPI2 clock
  *            @arg RCC_APB1LPeriph_SPI3:   SPI3 clock
  *            @arg RCC_APB1LPeriph_USART2: USART2 clock
  *            @arg RCC_APB1LPeriph_USART3: USART3 clock
  *            @arg RCC_APB1LPeriph_UART4:  UART4 clock
  *            @arg RCC_APB1LPeriph_UART5:  UART5 clock
  *            @arg RCC_APB1LPeriph_I2C1:   I2C1 clock
  *            @arg RCC_APB1LPeriph_I2C2:   I2C2 clock
  *            @arg RCC_APB1LPeriph_I2C3:   I2C3 clock
  *            @arg RCC_APB1LPeriph_CAN:    CAN clock
  *            @arg RCC_APB1LPeriph_PWR:    PWR clock
  *            @arg RCC_APB1LPeriph_DAC:    DAC clock
  *            @arg RCC_APB1LPeriph_OPAMP:  OPAMP clock
  *            @arg RCC_APB1LPeriph_LPTIM1: LPTIM1 clock  
  * @param  NewState: new state of the specified peripheral reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1LPeriphResetCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1L_PERIPH(RCC_APB1LPeriph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB1LRSTR |= RCC_APB1LPeriph;
  }
  else
  {
    RCC->APB1LRSTR &= ~RCC_APB1LPeriph;
  }
}

/**
  * @brief  Forces or releases Low Speed APB (APB1H) peripheral reset.
  * @param  RCC_APB1HPeriph: specifies the APB1 peripheral to reset.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1HPeriph_LPUART: LPUART clock
  *            @arg RCC_APB1HPeriph_SWP:    SWP clock
  *            @arg RCC_APB1HPeriph_LPTIM2: LPTIM2 clock  
  * @param  NewState: new state of the specified peripheral reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1HPeriphResetCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1H_PERIPH(RCC_APB1HPeriph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB1HRSTR |= RCC_APB1HPeriph;
  }
  else
  {
    RCC->APB1HRSTR &= ~RCC_APB1HPeriph;
  }
}
/**
  * @brief  Forces or releases High Speed APB (APB2) peripheral reset.
  * @param  RCC_APB2Periph: specifies the APB2 peripheral to reset.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB2Periph_SYSCFG:    SYSCFG clock
  *            @arg RCC_APB2Periph_COMP:      COMP clock
  *            @arg RCC_APB2Periph_SDIO:      SDIO clock
  *            @arg RCC_APB2Periph_TIM1:      TIM1 clock
  *            @arg RCC_APB2Periph_SPI1:      SPI1 clock
  *            @arg RCC_APB2Periph_TIM8:      TIM8 clock
  *            @arg RCC_APB2Periph_USART1:    USART1clock
  *            @arg RCC_APB2Periph_TIM15:     TIM15 clock
  *            @arg RCC_APB2Periph_TIM16:     TIM16 clock
  *            @arg RCC_APB2Periph_TIM17:     TIM17 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI1 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI2 clock
  *            @arg RCC_APB2Periph_DFSDM:     DFSDM clock 
  * @param  NewState: new state of the specified peripheral reset.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB2_RESET_PERIPH(RCC_APB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB2RSTR |= RCC_APB2Periph;
  }
  else
  {
    RCC->APB2RSTR &= ~RCC_APB2Periph;
  }
}

/**
  * @brief  Enables or disables the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_AHB1Periph: specifies the AHB1 peripheral to gates its clock.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_AHB1Periph_DMA1         DMA1 clock    
  *            @arg RCC_AHB1Periph_DMA2         DMA2 clock   
  *            @arg RCC_AHB1Periph_TSC          TSC clock   
  *            @arg RCC_AHB1Periph_FLASH        Flash clock
  *            @arg RCC_AHB1Periph_SRAM1        SRAM1 clock
  *            @arg RCC_AHB1Periph_CRC          CRC clock  
  * @param  NewState: new state of the specified peripheral clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB1PeriphClockLPModeCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB1_LPMODE_PERIPH(RCC_AHB1Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->AHB1LPENR |= RCC_AHB1Periph;
  }
  else
  {
    RCC->AHB1LPENR &= ~RCC_AHB1Periph;
  }
}

