RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_rcc.c
/**
  * @brief  Enables or disables the AHB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *           power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_AHB2Periph: specifies the AHB2 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_AHB2Periph_GPIOA:       GPIOA clock
  *            @arg RCC_AHB2Periph_GPIOB:       GPIOB clock 
  *            @arg RCC_AHB2Periph_GPIOC:       GPIOC clock
  *            @arg RCC_AHB2Periph_GPIOD:       GPIOD clock
  *            @arg RCC_AHB2Periph_GPIOE:       GPIOE clock
  *            @arg RCC_AHB2Periph_GPIOF:       GPIOF clock
  *            @arg RCC_AHB2Periph_GPIOG:       GPIOG clock
  *            @arg RCC_AHB2Periph_GPIOH:       GPIOH clock
  *            @arg RCC_AHB2Periph_SRAM2:       SRAM2 clock
  *            @arg RCC_AHB2Periph_OTGFS:       USB OTG Full Speed clock
  *            @arg RCC_AHB2Periph_ADC:         ADCs clock
  *            @arg RCC_AHB2Periph_AES:         AES clock
  *            @arg RCC_AHB2Periph_RNG:         RNG clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB2PeriphClockLPModeCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB2_LPMODE_PERIPH(RCC_AHB2Periph)); 
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->AHB2LPENR |= RCC_AHB2Periph;
  }
  else
  {
    RCC->AHB2LPENR &= ~RCC_AHB2Periph;
  }
}

/**
  * @brief  Enables or disables the AHB3 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_AHB3Periph: specifies the AHB3 peripheral to gates its clock.
  *          This parameter must be: RCC_AHB3Periph_FSMC or RCC_AHB3Periph_QSPI
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB3PeriphClockLPModeCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_AHB3_PERIPH(RCC_AHB3Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->AHB3LPENR |= RCC_AHB3Periph;
  }
  else
  {
    RCC->AHB3LPENR &= ~RCC_AHB3Periph;
  }
}

/**
  * @brief  Enables or disables the APB1L peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_APB1LPeriph: specifies the APB1 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1LPeriph_TIM2:   TIM3 clock  
  *            @arg RCC_APB1LPeriph_TIM3:   TIM3 clock
  *            @arg RCC_APB1LPeriph_TIM4:   TIM4 clock
  *            @arg RCC_APB1LPeriph_TIM5:   TIM5 clock
  *            @arg RCC_APB1LPeriph_TIM6:   TIM6 clock
  *            @arg RCC_APB1LPeriph_TIM7:   TIM7 clock
  *            @arg RCC_APB1LPeriph_LCD:    LCD clock
  *            @arg RCC_APB1LPeriph_WWDG:   WWDG clock
  *            @arg RCC_APB1LPeriph_SPI2:   SPI2 clock
  *            @arg RCC_APB1LPeriph_SPI3:   SPI3 clock
  *            @arg RCC_APB1LPeriph_USART2: USART2 clock
  *            @arg RCC_APB1LPeriph_USART3: USART3 clock
  *            @arg RCC_APB1LPeriph_UART4:  UART4 clock
  *            @arg RCC_APB1LPeriph_UART5:  UART5 clock
  *            @arg RCC_APB1LPeriph_I2C1:   I2C1 clock
  *            @arg RCC_APB1LPeriph_I2C2:   I2C2 clock
  *            @arg RCC_APB1LPeriph_I2C3:   I2C3 clock
  *            @arg RCC_APB1LPeriph_CAN:    CAN clock
  *            @arg RCC_APB1LPeriph_LPTIM1: LPTIM1 clock
  *            @arg RCC_APB1LPeriph_PWR:    PWR clock
  *            @arg RCC_APB1LPeriph_DAC:    DAC clock
  *            @arg RCC_APB1LPeriph_OPAMP:  OPAMP clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1LPeriphClockLPModeCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1L_LP_PERIPH(RCC_APB1LPeriph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB1LLPENR |= RCC_APB1LPeriph;
  }
  else
  {
    RCC->APB1LLPENR &= ~RCC_APB1LPeriph;
  }
}

/**
  * @brief  Enables or disables the APB1H peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_APB1HPeriph: specifies the APB1 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB1HPeriph_LPUART: LPUART clock
  *            @arg RCC_APB1HPeriph_SWP:    SWP clock
  *            @arg RCC_APB1HPeriph_LPTIM2: LPTIM2 clock
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1HPeriphClockLPModeCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB1H_PERIPH(RCC_APB1HPeriph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB1HLPENR |= RCC_APB1HPeriph;
  }
  else
  {
    RCC->APB1HLPENR &= ~RCC_APB1HPeriph;
  }
}
/**
  * @brief  Enables or disables the APB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @param  RCC_APB2Periph: specifies the APB2 peripheral to gates its clock.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_APB2Periph_SYSCFG:    SYSCFG clock
  *            @arg RCC_APB2Periph_COMP:      COMP clock
  *            @arg RCC_APB2Periph_FIREWALL:  FIREWALL clock
  *            @arg RCC_APB2Periph_SDIO:      SDIO clock
  *            @arg RCC_APB2Periph_TIM1:      TIM1 clock
  *            @arg RCC_APB2Periph_SPI1:      SPI1 clock
  *            @arg RCC_APB2Periph_TIM8:      TIM8 clock
  *            @arg RCC_APB2Periph_USART1:    USART1clock
  *            @arg RCC_APB2Periph_TIM15:     TIM15 clock
  *            @arg RCC_APB2Periph_TIM16:     TIM16 clock
  *            @arg RCC_APB2Periph_TIM17:     TIM17 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI1 clock
  *            @arg RCC_APB2Periph_SAI1:      SAI2 clock
  *            @arg RCC_APB2Periph_DFSDM:     DFSDM clock    
  * @param  NewState: new state of the specified peripheral clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphClockLPModeCmd(uint32_t RCC_APB2Periph, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_APB2_PERIPH(RCC_APB2Periph));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    RCC->APB2LPENR |= RCC_APB2Periph;
  }
  else
  {
    RCC->APB2LPENR &= ~RCC_APB2Periph;
  }
}

/**
  * @}
  */

/** @defgroup RCC_Group4 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions 
 *
@verbatim   
 ===============================================================================
                ##### Interrupts and flags management functions #####
 ===============================================================================  

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified RCC interrupts.
  * @param  RCC_IT: specifies the RCC interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_MSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLSAI1RDY: PLLSAI1 ready interrupt
  *            @arg RCC_IT_PLLSAI2RDY: PLLSAI2 ready interrupt
  *            @arg RCC_IT_LSECSS: Clock security system interrupt 
  * @param  NewState: new state of the specified RCC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_ITConfig(uint32_t RCC_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_IT(RCC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
   
   RCC->CIER |= RCC_IT;
  }
  else
  {
    RCC->CIER &= ~RCC_IT;
  }
}

/**
  * @brief  Checks whether the specified RCC flag is set or not.
  * @param  RCC_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_FLAG_MSIRDY: MSI oscillator clock ready
  *            @arg RCC_FLAG_HSIRDY: HSI oscillator clock ready
  *            @arg RCC_FLAG_HSERDY: HSE oscillator clock ready
  *            @arg RCC_FLAG_PLLRDY: main PLL clock ready
  *            @arg RCC_FLAG_PLLSAI2RDY: PLLSAI2 clock ready 
  *            @arg RCC_FLAG_PLLSAI1RDY: PLLSAI1 clock ready 
  *            @arg RCC_FLAG_LSERDY: LSE oscillator clock ready
  *            @arg RCC_FLAG_LSIRDY: LSI oscillator clock ready
  *            @arg RCC_FLAG_PORRST: POR/PDR or BOR reset
  *            @arg RCC_FLAG_OBLRST: OBLRST reset
  *            @arg RCC_FLAG_PINRST: Pin reset
  *            @arg RCC_FLAG_FIREWALLRST: FIREWALL reset
  *            @arg RCC_FLAG_RMVF: Remove  reset Flag
  *            @arg RCC_FLAG_SFTRST: Software reset
  *            @arg RCC_FLAG_IWDGRST: Independent Watchdog reset
  *            @arg RCC_FLAG_WWDGRST: Window Watchdog reset
  *            @arg RCC_FLAG_LPWRRST: Low Power reset
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
FlagStatus RCC_GetFlagStatus(uint32_t RCC_FLAG)
{
  uint32_t tmp = 0;
  uint32_t statusreg = 0;
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_FLAG(RCC_FLAG));

  /* Get the RCC register index */
  tmp = RCC_FLAG >> 5;
  if (tmp == 1)               /* The flag to check is in CR register */
  {
    statusreg = RCC->CR;
  }
  else if (tmp == 2)          /* The flag to check is in BDCR register */
  {
    statusreg = RCC->BDCR;
  }
  else                       /* The flag to check is in CSR register */
  {
    statusreg = RCC->CSR;
  }

  /* Get the flag position */
  tmp = RCC_FLAG & RCC_FLAG_MASK;
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the RCC reset flags.
  *         The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_BORRST,  RCC_FLAG_SFTRST,
  *         RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPWRRST,RCC_FLAG_OBLRST,
  *         RCC_FLAG_FIREWALLRST.
  * @param  None
  * @retval None
  */
void RCC_ClearFlag(void)
{
  /* Set RMVF bit to clear the reset flags */
  RCC->CSR |= RCC_CSR_RMVF;
}

/**
  * @brief  Checks whether the specified RCC interrupt has occurred or not.
  * @param  RCC_IT: specifies the RCC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_MSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLSAI1RDY: PLLSAI1 ready interrupt
  *            @arg RCC_IT_PLLSAI2RDY: PLLSAI2 ready interrupt
  *            @arg RCC_IT_HSECSS: HSE Clock Security interrupt
  *            @arg RCC_IT_LSECSS: Clock security system interrupt 
  * @retval The new state of RCC_IT (SET or RESET).
  */
ITStatus RCC_GetITStatus(uint32_t RCC_IT)
{
  ITStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_RCC_GET_IT(RCC_IT));

  /* Check the status of the specified RCC interrupt */
  if ((RCC->CIFR & RCC_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  /* Return the RCC_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the RCC's interrupt pending bits.
  * @param  RCC_IT: specifies the interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY: LSI ready interrupt
  *            @arg RCC_IT_LSERDY: LSE ready interrupt
  *            @arg RCC_IT_MSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSIRDY: HSI ready interrupt
  *            @arg RCC_IT_HSERDY: HSE ready interrupt
  *            @arg RCC_IT_PLLRDY: main PLL ready interrupt
  *            @arg RCC_IT_PLLSAI1RDY: PLLSAI1 ready interrupt
  *            @arg RCC_IT_PLLSAI2RDY: PLLSAI2 ready interrupt
  *            @arg RCC_IT_HSECSS: HSE Clock Security interrupt
  *            @arg RCC_IT_LSECSS: Clock security system interrupt 
  * @retval None
  */
void RCC_ClearITPendingBit(uint32_t RCC_IT)
{
  /* Check the parameters */
   assert_param(IS_RCC_CLEAR_IT(RCC_IT));

    RCC->CICR = RCC_IT;
}

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
